Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MK-GP_DFP/1.4.117/atdf/PIC32MK0512GPG048.atdf
      <value-group caption="Secondary Oscillator Kick Start Programmability bit" name="DEVCFG0__SOSCBOOST">
         <value caption="Start up and operate with high-power SOSC internal buffer only" name="ON" value="0x1" />
         <value caption="Start up with internal SOSC high-power buffer, and then switch to low-power buffer when the SOSC is stable" name="OFF" value="0x0" />
      </value-group>
      <value-group caption="Primary Crystal Oscillator Course Gain Control bits" name="DEVCFG0__POSCGAIN">
         <value caption="Gain Level 3 (highest)" name="G3" value="0x3" />
         <value caption="Gain Level 2" name="G2" value="0x2" />
         <value caption="Gain Level 1" name="G1" value="0x1" />
         <value caption="Gain Level 0 (Lowest)" name="G0" value="0x0" />
      </value-group>
      <value-group caption="Primary Oscillator Boost bit" name="DEVCFG0__POSCBOOST">
         <value caption="Uses internal XTAL feedback gain resistor" name="ON" value="0x1" />
         <value caption="Disconnects the internal XTAL feedback resistor" name="OFF" value="0x0" />
      </value-group>
      <value-group caption="Primary Crystal Oscillator Fine Gain Control bits" name="DEVCFG0__POSCFGAIN">
         <value caption="Gain is G3 (highest, default)" name="G3" value="0x3" />
         <value caption="Gain is G2" name="G2" value="0x2" />
         <value caption="Gain is G1" name="G1" value="0x1" />
         <value caption="Gain is G0 (lowest)" name="G0" value="0x0" />
      </value-group>
      <value-group caption="Primary Crystal AGC Gain Search Step Settling Time Control bits" name="DEVCFG0__POSCAGCDLY">
         <value caption="Approximately (25 ms) (default)" name="AGCRNG_x_25ms" value="0x3" />
         <value caption="Approximately (6.25 ms)" name="AGCRNG_x_6_25ms" value="0x2" />
         <value caption="Approximately (400 ms)" name="AGCRNG_x_400ms" value="0x1" />
         <value caption="Approximately (100 ms)" name="AGCRNG_x_100ms" value="0x0" />
      </value-group>
      <value-group caption="Primary Oscillator Automatic Gain Control bit" name="DEVCFG0__POSCAGC">
         <value caption="Automatic Gain Control for Oscillator" name="Automatic" value="0x1" />
         <value caption="Manual Gain Control of Oscillator" name="Manual" value="0x0" />
      </value-group>
      <value-group caption="EJTAG Boot Enable bit" name="DEVCFG0__EJTAGBEN">
         <value caption="Reduced EJTAG functionality" name="REDUCED" value="0x0" />
         <value caption="Normal EJTAG functionality" name="NORMAL" value="0x1" />
      </value-group>
      <value-group caption="" name="DEVCP__CP">
         <value caption="Protection Enabled" name="ON" value="0x0" />
         <value caption="Protection Disabled" name="OFF" value="0x1" />
      </value-group>
      <value-group caption="Boot Flash True Sequence Number" name="DEVSEQ3__TSEQ">
         <value caption="Boot Flash True Sequence Number" name="" />
      </value-group>
      <value-group caption="Boot Flash Complement Sequence Number" name="DEVSEQ3__CSEQ">
         <value caption="Boot Flash Complement Sequence Number" name="" />
      </value-group>
      <value-group caption="" name="DEVADC0__ADCCALDATA">
         <value caption="" name="" />
         <value caption="" name="" />
         <value caption="" name="" />
         <value caption="" name="" />
         <value caption="" name="" />
         <value caption="" name="" />
         <value caption="" name="" />
      </value-group>
      <value-group caption="" name="DEVSN0__SN">
         <value caption="" name="" />
         <value caption="" name="" />
         <value caption="" name="" />
         <value caption="" name="" />
      </value-group>
      <value-group caption="" name="DEVEE0__EECALDATA">
         <value caption="" name="" />
         <value caption="" name="" />
         <value caption="" name="" />
         <value caption="" name="" />
      </value-group>
   </module>
   <module caption="" id="02508" name="ADCHS" version="">
      <register-group name="ADCHS">
         <register caption="ADC Control Register 1" name="ADCCON1" offset="0x0" rw="RW" size="4">
            <bitfield caption="DMA to System RAM Buffer Length Size bits" mask="0x00000007" name="DMABL" values="ADCCON1__DMABL" />
            <bitfield caption="Scan Trigger High Level/Positive Edge Sensitivity bit" mask="0x00000008" name="STRGLVL" values="ADCCON1__STRGLVL" />
            <bitfield caption="Interrupt Vector Shift bits" mask="0x00000070" name="IRQVS" values="ADCCON1__IRQVS" />
            <bitfield caption="Fast Synchronous Peripheral Clock to ADC Control Clock bit" mask="0x00000200" name="FSPBCLKEN" values="ADCCON1__FSPBCLKEN" />
            <bitfield caption="Fast Synchronous System Clock to ADC Control Clock bit" mask="0x00000400" name="FSSCLKEN" values="ADCCON1__FSSCLKEN" />
            <bitfield caption="Capacitive Voltage Division Enable bit" mask="0x00000800" name="CVDEN" values="ADCCON1__CVDEN" />
            <bitfield caption="Analog Input Charge Pump Enable bit" mask="0x00001000" name="AICPMPEN" values="ADCCON1__AICPMPEN" />
            <bitfield caption="Stop in Idle Mode bit" mask="0x00002000" name="SIDL" values="ADCCON1__SIDL" />
            <bitfield caption="ADC Module Enable bit" mask="0x00008000" name="ON" values="ADCCON1__ON" />
            <bitfield caption="Scan Trigger Source Select bits" mask="0x001F0000" name="STRGSRC" values="ADCCON1__STRGSRC" />
            <bitfield caption="Shared ADC7 Resolution bits" mask="0x00600000" name="SELRES" values="ADCCON1__SELRES" />
            <bitfield caption="Fractional Data Output Format bit" mask="0x00800000" name="FRACT" values="ADCCON1__FRACT" />
         </register>
         <register caption="ADC Control Register 2" name="ADCCON2" offset="0x10" rw="RW" size="4">
            <bitfield caption="Shared ADC Clock Divider bits" mask="0x0000007F" name="ADCDIV" values="ADCCON2__ADCDIV" />
            <bitfield caption="Shared ADC Early Interrupt Select bits" mask="0x00000700" name="ADCEIS" values="ADCCON2__ADCEIS" />
            <bitfield caption="Early Interrupt Request Override bit" mask="0x00001000" name="ADCEIOVR" values="ADCCON2__ADCEIOVR" />
            <bitfield caption="End of Scan Interrupt Enable bit" mask="0x00002000" name="EOSIEN" values="ADCCON2__EOSIEN" />
            <bitfield caption="Band Gap/ Vref Voltage Fault Interrupt Enable bit" mask="0x00004000" name="REFFLTIEN" values="ADCCON2__REFFLTIEN" />
            <bitfield caption="Band Gap/ Vref Voltage Ready Interrupt Enable bit" mask="0x00008000" name="BGVRIEN" values="ADCCON2__BGVRIEN" />
            <bitfield caption="Sample Time for the Shared ADC (ADC7) bits" mask="0x03FF0000" name="SAMC" values="ADCCON2__SAMC" />
            <bitfield caption="Capacitor Voltage Divider Setting bits" mask="0x1C000000" name="CVDCPL" values="ADCCON2__CVDCPL" />
            <bitfield caption="End of Scan Interrupt Status bit" mask="0x20000000" name="EOSRDY" values="ADCCON2__EOSRDY" />
            <bitfield caption="Band Gap/ Vref / AVdd BOR Fault Status bit" mask="0x40000000" name="REFFLT" values="ADCCON2__REFFLT" />
            <bitfield caption="Band Gap Voltage/ADC Reference Voltage Status bit" mask="0x80000000" name="BGVRRDY" values="ADCCON2__BGVRRDY" />
         </register>
