Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MK-GP_DFP/1.4.117/atdf/PIC32MK0512GPG048.atdf
      <value-group caption="AN36 Mode bit" name="ADCIMCON3__DIFF36">
         <value caption="Selects AN36 differential input pair as AN36+ and AN1-" name="" value="0x1" />
         <value caption="AN36 is using Single-ended mode" name="" value="0x0" />
      </value-group>
      <value-group caption="AN37 Signed Data Mode bit" name="ADCIMCON3__SIGN37">
         <value caption="AN37 is using Signed Data mode" name="" value="0x1" />
         <value caption="AN37 is using Unsigned Data mode" name="" value="0x0" />
      </value-group>
      <value-group caption="AN37 Mode bit" name="ADCIMCON3__DIFF37">
         <value caption="Selects AN37 differential input pair as AN37+ and AN1-" name="" value="0x1" />
         <value caption="AN37 is using Single-ended mode" name="" value="0x0" />
      </value-group>
      <value-group caption="AN38 Signed Data Mode bit" name="ADCIMCON3__SIGN38">
         <value caption="AN38 is using Signed Data mode" name="" value="0x1" />
         <value caption="AN38 is using Unsigned Data mode" name="" value="0x0" />
      </value-group>
      <value-group caption="AN38 Mode bit" name="ADCIMCON3__DIFF38">
         <value caption="Selects AN38 differential input pair as AN38+ and AN1-" name="" value="0x1" />
         <value caption="AN38 is using Single-ended mode" name="" value="0x0" />
      </value-group>
      <value-group caption="AN39 Signed Data Mode bit" name="ADCIMCON3__SIGN39">
         <value caption="AN39 is using Signed Data mode" name="" value="0x1" />
         <value caption="AN39 is using Unsigned Data mode" name="" value="0x0" />
      </value-group>
      <value-group caption="AN39 Mode bit" name="ADCIMCON3__DIFF39">
         <value caption="Selects AN39 differential input pair as AN39+ and AN1-" name="" value="0x1" />
         <value caption="AN39 is using Single-ended mode" name="" value="0x0" />
      </value-group>
      <value-group caption="AN40 Signed Data Mode bit" name="ADCIMCON3__SIGN40">
         <value caption="AN40 is using Signed Data mode" name="" value="0x1" />
         <value caption="AN40 is using Unsigned Data mode" name="" value="0x0" />
      </value-group>
      <value-group caption="AN40 Mode bit" name="ADCIMCON3__DIFF40">
         <value caption="Selects AN40 differential input pair as AN40+ and AN1-" name="" value="0x1" />
         <value caption="AN40 is using Single-ended mode" name="" value="0x0" />
      </value-group>
      <value-group caption="AN41 Signed Data Mode bit" name="ADCIMCON3__SIGN41">
         <value caption="AN41 is using Signed Data mode" name="" value="0x1" />
         <value caption="AN41 is using Unsigned Data mode" name="" value="0x0" />
      </value-group>
      <value-group caption="AN41 Mode bit" name="ADCIMCON3__DIFF41">
         <value caption="Selects AN41 differential input pair as AN41+ and AN1-" name="" value="0x1" />
         <value caption="AN41 is using Single-ended mode" name="" value="0x0" />
      </value-group>
      <value-group caption="" name="ADCIMCON3__SIGN45">
         <value caption="AN45 is using Signed Data mode" name="" value="0x1" />
         <value caption="AN45 is using Unsigned Data mode" name="" value="0x0" />
      </value-group>
      <value-group caption="AN45 Mode bit" name="ADCIMCON3__DIFF45">
         <value caption="Selects AN45 differential input pair as AN45+ and AN1-" name="" value="0x1" />
         <value caption="AN45 is using Single-ended mode" name="" value="0x0" />
      </value-group>
      <value-group caption="AN45 Signed Data Mode bit" name="ADCIMCON3__SIGN46">
         <value caption="AN46 is using Signed Data mode" name="" value="0x1" />
         <value caption="AN46 is using Unsigned Data mode" name="" value="0x0" />
      </value-group>
      <value-group caption="AN46 Mode bit" name="ADCIMCON3__DIFF46">
         <value caption="Selects AN46 differential input pair as AN46+ and AN1-" name="" value="0x1" />
         <value caption="AN41 is using Single-ended mode" name="" value="0x0" />
      </value-group>
      <value-group caption="AN47 Signed Data Mode bit" name="ADCIMCON3__SIGN47">
         <value caption="AN41 is using Signed Data mode" name="" value="0x1" />
         <value caption="AN41 is using Unsigned Data mode" name="" value="0x0" />
      </value-group>
      <value-group caption="AN47 Mode bit" name="ADCIMCON3__DIFF47">
         <value caption="Selects AN47 differential input pair as AN47+ and AN1-" name="" value="0x1" />
         <value caption="AN47 is using Single-ended mode" name="" value="0x0" />
      </value-group>
      <value-group caption="AN48 Signed Data Mode bit" name="ADCIMCON4__SIGN48">
         <value caption="AN48 is using Signed Data mode" name="" value="0x1" />
         <value caption="AN48 is using Unsigned Data mode" name="" value="0x0" />
      </value-group>
      <value-group caption="AN48 Mode bit" name="ADCIMCON4__DIFF48">
         <value caption="Selects AN40 differential input pair as AN48+ and AN1-" name="" value="0x1" />
         <value caption="AN48 is using Single-ended mode" name="" value="0x0" />
      </value-group>
      <value-group caption="AN41 Signed Data Mode bit" name="ADCIMCON4__SIGN49">
         <value caption="AN49 is using Signed Data mode" name="" value="0x1" />
         <value caption="AN49 is using Unsigned Data mode" name="" value="0x0" />
      </value-group>
      <value-group caption="AN49 Mode bit" name="ADCIMCON4__DIFF49">
         <value caption="Selects AN49 differential input pair as AN49+ and AN1-" name="" value="0x1" />
         <value caption="AN49 is using Single-ended mode" name="" value="0x0" />
      </value-group>
      <value-group caption="ADC Global Interrupt Enable bit" name="ADCGIRQEN1__AGIEN0">
         <value caption="Interrupts are enabled for the selected analog input. The interrupt is generated after the converted data is ready (indicated by the AIRDYx bit of the ADCDSTAT1 register)" name="" value="0x1" />
         <value caption="Interrupts are disabled" name="" value="0x0" />
      </value-group>
      <value-group caption="ADC Global Interrupt Enable bit" name="ADCGIRQEN1__AGIEN1">
         <value caption="Interrupts are enabled for the selected analog input. The interrupt is generated after the converted data is ready (indicated by the AIRDYx bit of the ADCDSTAT1 register)" name="" value="0x1" />
         <value caption="Interrupts are disabled" name="" value="0x0" />
      </value-group>
      <value-group caption="ADC Global Interrupt Enable bit" name="ADCGIRQEN1__AGIEN2">
         <value caption="Interrupts are enabled for the selected analog input. The interrupt is generated after the converted data is ready (indicated by the AIRDYx bit of the ADCDSTAT1 register)" name="" value="0x1" />
         <value caption="Interrupts are disabled" name="" value="0x0" />
      </value-group>
      <value-group caption="ADC Global Interrupt Enable bit" name="ADCGIRQEN1__AGIEN3">
         <value caption="Interrupts are enabled for the selected analog input. The interrupt is generated after the converted data is ready (indicated by the AIRDYx bit of the ADCDSTAT1 register)" name="" value="0x1" />
         <value caption="Interrupts are disabled" name="" value="0x0" />
      </value-group>
