Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MK-GP_DFP/1.4.117/atdf/PIC32MK0512GPG048.atdf
         <register caption="" name="UserTraceData" offset="0x148" rw="RW" size="4">
            <bitfield mask="0xFFFFFFFF" name="Data" />
         </register>
         <register caption="" name="TraceBPC" offset="0x14c" rw="RW" size="4">
            <bitfield mask="0x000000FF" name="IBPOn" />
            <bitfield mask="0x00008000" name="IE" />
            <bitfield mask="0x00FF0000" name="DBPOn" />
            <bitfield mask="0x80000000" name="DE" />
         </register>
         <register caption="" name="Debug2" offset="0x150" rw="R" size="4">
            <bitfield mask="0x00000001" name="PACO" />
            <bitfield mask="0x00000002" name="TUP" />
            <bitfield mask="0x00000004" name="DQ" />
            <bitfield mask="0x00000008" name="PRM" />
         </register>
         <register caption="" name="DEPC" offset="0x154" rw="RW" size="4">
            <bitfield mask="0xFFFFFFFF" name="DEPC" />
         </register>
         <register caption="" name="UserTraceData2" offset="0x158" rw="RW" size="4">
            <bitfield mask="0xFFFFFFFF" name="Data" />
         </register>
         <register caption="" name="PerfCtl0" offset="0x15c" rw="RW" size="4">
            <bitfield mask="0x00000001" name="EXL" />
            <bitfield mask="0x00000002" name="K" />
            <bitfield mask="0x00000008" name="U" />
            <bitfield mask="0x00000010" name="IE" />
            <bitfield mask="0x00000FE0" name="EVENT" />
            <bitfield mask="0x0000F000" name="EVENTEXT" />
            <bitfield mask="0x03000000" name="EC" />
         </register>
         <register caption="" name="PerfCnt0" offset="0x160" rw="RW" size="4">
            <bitfield mask="0xFFFFFFFF" name="Counter" />
         </register>
         <register caption="" name="PerfCtl1" offset="0x164" rw="RW" size="4">
            <bitfield mask="0x00000001" name="EXL" />
            <bitfield mask="0x00000002" name="K" />
            <bitfield mask="0x00000008" name="U" />
            <bitfield mask="0x00000010" name="IE" />
            <bitfield mask="0x00000FE0" name="EVENT" />
            <bitfield mask="0x0000F000" name="EVENTEXT" />
            <bitfield mask="0x03000000" name="EC" />
         </register>
         <register caption="" name="PerfCnt1" offset="0x168" rw="RW" size="4">
            <bitfield mask="0xFFFFFFFF" name="Counter" />
         </register>
         <register caption="" name="ErrCtl" offset="0x16c" rw="RW" size="4">
            <bitfield mask="0x20000000" name="WST" />
         </register>
         <register caption="" name="CacheErr" offset="0x170" rw="R" size="4">
            <bitfield mask="0x000FFFFF" name="Index" />
            <bitfield mask="0x00300000" name="Way" />
            <bitfield mask="0x00400000" name="EW" />
            <bitfield mask="0x00800000" name="SP" />
            <bitfield mask="0x01000000" name="EF" />
            <bitfield mask="0x02000000" name="EB" />
            <bitfield mask="0x04000000" name="EE" />
            <bitfield mask="0x08000000" name="ES" />
            <bitfield mask="0x10000000" name="ET" />
            <bitfield mask="0x20000000" name="ED" />
            <bitfield mask="0x40000000" name="EC" />
            <bitfield mask="0x80000000" name="ER" />
         </register>
         <register caption="" name="TagLo" offset="0x174" rw="RW" size="4">
            <bitfield mask="0x00000020" name="L" />
            <bitfield mask="0x00000040" name="D" />
            <bitfield mask="0x00000080" name="V" />
            <bitfield mask="0xFFFFFC00" name="PA" />
         </register>
         <register caption="" name="TagLo_RAM" offset="0x178" rw="RW" size="4">
            <bitfield mask="0x0000FC00" name="WSLRU" />
            <bitfield mask="0x000F0000" name="WSD" />
         </register>
         <register caption="" name="DataLo" offset="0x17c" rw="RW" size="4">
            <bitfield mask="0xFFFFFFFF" name="DATA" />
         </register>
         <register caption="" name="ErrorEPC" offset="0x180" rw="RW" size="4">
            <bitfield mask="0xFFFFFFFF" name="ErrorEPC" />
         </register>
         <register caption="" name="DESAVE" offset="0x184" rw="RW" size="4">
            <bitfield mask="0xFFFFFFFF" name="DESAVE" />
         </register>
         <register caption="" name="lo" offset="0x188" rw="RW" size="4">
            <bitfield mask="0xFFFFFFFF" name="MDUlow" />
         </register>
         <register caption="" name="hi" offset="0x18c" rw="RW" size="4">
            <bitfield mask="0xFFFFFFFF" name="MDUhigh" />
         </register>
         <register caption="" name="lo1" offset="0x190" rw="RW" size="4">
            <bitfield mask="0xFFFFFFFF" name="MDUlow" />
         </register>
         <register caption="" name="hi1" offset="0x194" rw="RW" size="4">
            <bitfield mask="0xFFFFFFFF" name="MDUhigh" />
         </register>
         <register caption="" name="lo2" offset="0x198" rw="RW" size="4">
            <bitfield mask="0xFFFFFFFF" name="MDUlow" />
         </register>
         <register caption="" name="hi2" offset="0x19c" rw="RW" size="4">
            <bitfield mask="0xFFFFFFFF" name="MDUhigh" />
         </register>
         <register caption="" name="lo3" offset="0x1a0" rw="RW" size="4">
            <bitfield mask="0xFFFFFFFF" name="MDUlow" />
         </register>
         <register caption="" name="hi3" offset="0x1a4" rw="RW" size="4">
            <bitfield mask="0xFFFFFFFF" name="MDUhigh" />
         </register>
         <register caption="" name="DSPControl" offset="0x1a8" rw="RW" size="4">
            <bitfield mask="0x0000003F" name="POS" />
            <bitfield mask="0x00001F80" name="SCOUNT" />
            <bitfield mask="0x00002000" name="C" />
            <bitfield mask="0x00004000" name="EFI" />
            <bitfield mask="0x00FF0000" name="OUTFLAG" />
            <bitfield mask="0x0F000000" name="CCOND" />
         </register>
         <register caption="" name="f0" offset="0x1ac" rw="RW" size="8">
            <bitfield mask="0xFFFFFFFFFFFFFFFF" name="f0" />
         </register>
         <register caption="" name="f1" offset="0x1b0" rw="RW" size="8">
            <bitfield mask="0xFFFFFFFFFFFFFFFF" name="f1" />
         </register>
         <register caption="" name="f2" offset="0x1b4" rw="RW" size="8">
            <bitfield mask="0xFFFFFFFFFFFFFFFF" name="f2" />
         </register>
         <register caption="" name="f3" offset="0x1b8" rw="RW" size="8">
            <bitfield mask="0xFFFFFFFFFFFFFFFF" name="f3" />
         </register>
         <register caption="" name="f4" offset="0x1bc" rw="RW" size="8">
            <bitfield mask="0xFFFFFFFFFFFFFFFF" name="f4" />
         </register>
         <register caption="" name="f5" offset="0x1c0" rw="RW" size="8">
            <bitfield mask="0xFFFFFFFFFFFFFFFF" name="f5" />
         </register>
         <register caption="" name="f6" offset="0x1c4" rw="RW" size="8">
            <bitfield mask="0xFFFFFFFFFFFFFFFF" name="f6" />
         </register>
         <register caption="" name="f7" offset="0x1c8" rw="RW" size="8">
            <bitfield mask="0xFFFFFFFFFFFFFFFF" name="f7" />
         </register>
         <register caption="" name="f8" offset="0x1cc" rw="RW" size="8">
            <bitfield mask="0xFFFFFFFFFFFFFFFF" name="f8" />
         </register>
         <register caption="" name="f9" offset="0x1d0" rw="RW" size="8">
            <bitfield mask="0xFFFFFFFFFFFFFFFF" name="f9" />
         </register>
         <register caption="" name="f10" offset="0x1d4" rw="RW" size="8">
            <bitfield mask="0xFFFFFFFFFFFFFFFF" name="f10" />
         </register>
         <register caption="" name="f11" offset="0x1d8" rw="RW" size="8">
            <bitfield mask="0xFFFFFFFFFFFFFFFF" name="f11" />
         </register>
