Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MK-GP_DFP/1.4.117/atdf/PIC32MK0512GPG048.atdf
      <value-group caption="Edge Sequence Enable bit" name="CTMUCON__EDGSEQEN">
         <value caption="Edge1 must occur before Edge2 can occur" name="" value="0x1" />
         <value caption="No edge sequence is needed" name="" value="0x0" />
      </value-group>
      <value-group caption="Edge Enable bit" name="CTMUCON__EDGEN">
         <value caption="Edges are not blocked" name="" value="0x1" />
         <value caption="Edges are blocked" name="" value="0x0" />
      </value-group>
      <value-group caption="Time Generation Enable bit" name="CTMUCON__TGEN">
         <value caption="Enables edge delay generation" name="" value="0x1" />
         <value caption="Disables edge delay generation" name="" value="0x0" />
      </value-group>
      <value-group caption="Stop-in-Idle-Mode" name="CTMUCON__SIDLE">
         <value caption="Discontinue Module Operation when device enters idle mode" name="" value="0x1" />
         <value caption="Continue module operation in idle mode" name="" value="0x0" />
      </value-group>
      <value-group caption="ON Enable bit" name="CTMUCON__ON">
         <value caption="Module is enabled" name="" value="0x1" />
         <value caption="Module is disabled" name="" value="0x0" />
      </value-group>
      <value-group caption="Edge 2 Source Select bits" name="CTMUCON__EDG2SEL">
         <value caption="C5OUT Capture Event is selected" name="" value="0xf" />
         <value caption="C4OUT pin is selected" name="" value="0xe" />
         <value caption="C1OUT pin is selected" name="" value="0xd" />
         <value caption="IC6 Capture Event is selected" name="" value="0xc" />
         <value caption="IC5 Capture Event is selected" name="" value="0xb" />
         <value caption="IC4 Capture Event is selected" name="" value="0xa" />
         <value caption="IC3 Capture Event is selected" name="" value="0x9" />
         <value caption="IC2 Capture Event is selected" name="" value="0x8" />
         <value caption="IC1 Capture Event is selected" name="" value="0x7" />
         <value caption="OC4 Capture Event is selected" name="" value="0x6" />
         <value caption="OC3 Capture Event is selected" name="" value="0x5" />
         <value caption="OC2 Capture Event is selected" name="" value="0x4" />
         <value caption="CTED1 pin is selected" name="" value="0x3" />
         <value caption="CTED2 pin is selected" name="" value="0x2" />
         <value caption="OC1 Compare Event is selected" name="" value="0x1" />
         <value caption="Timer1 Event is selected" name="" value="0x0" />
      </value-group>
      <value-group caption="Edge 2 Polarity Select bit" name="CTMUCON__EDG2POL">
         <value caption="Edge2 programmed for a high level response" name="" value="0x1" />
         <value caption="Edge2 programmed for a low level response" name="" value="0x0" />
      </value-group>
      <value-group caption="Edge2 Edge Sampling Select bit" name="CTMUCON__EDG2MOD">
         <value caption="Input is level-sensitive" name="" value="0x0" />
      </value-group>
      <value-group caption="Edge1 Status bit" name="CTMUCON__EDG1STAT">
         <value caption="Edge1 event has occurred" name="" value="0x1" />
         <value caption="Edge1 event has not occurred" name="" value="0x0" />
      </value-group>
      <value-group caption="Edge2 Status bit" name="CTMUCON__EDG2STAT">
         <value caption="Edge2 event has occurred" name="" value="0x1" />
         <value caption="Edge2 event has not occurred" name="" value="0x0" />
      </value-group>
      <value-group caption="Edge 1 Source Select bits" name="CTMUCON__EDG1SEL">
         <value caption="C5OUT pin is selected" name="" value="0xf" />
         <value caption="C4OUT pin is selected" name="" value="0xe" />
         <value caption="C1OUT pin is selected" name="" value="0xd" />
         <value caption="PBCLK2 is selected" name="" value="0xc" />
         <value caption="IC5 Capture Event is selected" name="" value="0xb" />
         <value caption="IC4 Capture Event is selected" name="" value="0xa" />
         <value caption="IC3 Capture Event is selected" name="" value="0x9" />
         <value caption="IC2 Capture Event is selected" name="" value="0x8" />
         <value caption="IC1 Capture Event is selected" name="" value="0x7" />
         <value caption="OC4 Capture Event is selected" name="" value="0x6" />
         <value caption="OC3 Capture Event is selected" name="" value="0x5" />
         <value caption="OC2 Capture Event is selected" name="" value="0x4" />
         <value caption="CTED1 pin is selected" name="" value="0x3" />
         <value caption="CTED2 pin is selected" name="" value="0x2" />
         <value caption="OC1 Compare Event is selected" name="" value="0x1" />
         <value caption="Timer1 Event is selected" name="" value="0x0" />
      </value-group>
      <value-group caption="Edge 1 Polarity Select bit" name="CTMUCON__EDG1POL">
         <value caption="Edge1 programmed for a logic high level response" name="" value="0x1" />
         <value caption="Edge1 programmed for a logic low level response" name="" value="0x0" />
      </value-group>
      <value-group caption="Edge1 Edge Sampling Select bit" name="CTMUCON__EDG1MOD">
         <value caption="Input is level-sensitive" name="" value="0x0" />
      </value-group>
   </module>
   <module caption="" id="01500" name="DMAC" version="2">
      <register-group name="DMAC">
         <register caption="DMA Controller Control Register" name="DMACON" offset="0x0" rw="RW" size="4">
            <bitfield caption="DMA Module Busy bit" mask="0x00000800" name="DMABUSY" values="DMACON__DMABUSY" />
            <bitfield caption="DMA Suspend bit" mask="0x00001000" name="SUSPEND" values="DMACON__SUSPEND" />
            <bitfield caption="DMA On bit" mask="0x00008000" name="ON" values="DMACON__ON" />
         </register>
         <register caption="DMA Status Register" name="DMASTAT" offset="0x10" rw="R" size="4">
            <bitfield mask="0x00000007" name="DMACH" />
            <bitfield caption="Read/Write Status bit" mask="0x80000000" name="RDWR" values="DMASTAT__RDWR" />
         </register>
         <register caption="DMA Address Register" name="DMAADDR" offset="0x20" rw="R" size="4">
            <bitfield mask="0xFFFFFFFF" name="DMAADDR" />
         </register>
         <register caption="DMA CRC Control Register" name="DCRCCON" offset="0x30" rw="RW" size="4">
            <bitfield caption="CRC Channel Select bits" mask="0x00000007" name="CRCCH" values="DCRCCON__CRCCH" />
            <bitfield caption="CRC Type Selection bit" mask="0x00000020" name="CRCTYP" values="DCRCCON__CRCTYP" />
            <bitfield caption="CRC Append Mode bit" mask="0x00000040" name="CRCAPP" values="DCRCCON__CRCAPP" />
            <bitfield caption="CRC Enable bit" mask="0x00000080" name="CRCEN" values="DCRCCON__CRCEN" />
            <bitfield caption="Polynomial Length bits" mask="0x00001F00" name="PLEN" values="DCRCCON__PLEN" />
            <bitfield caption="CRC Bit Order Selection bit" mask="0x01000000" name="BITO" values="DCRCCON__BITO" />
            <bitfield caption="CRC Write Byte Order Selection bit" mask="0x08000000" name="WBO" values="DCRCCON__WBO" />
            <bitfield caption="CRC Byte Order Selection bits" mask="0x30000000" name="BYTO" values="DCRCCON__BYTO" />
         </register>
         <register caption="DMA CRC Data Register" name="DCRCDATA" offset="0x40" rw="RW" size="4">
            <bitfield caption="CRC Data Register bits" mask="0xFFFFFFFF" name="DCRCDATA" values="DCRCDATA__DCRCDATA" />
         </register>
         <register caption="DMA CRCXOR Enable Register" name="DCRCXOR" offset="0x50" rw="RW" size="4">
            <bitfield caption="CRC XOR Register bits" mask="0xFFFFFFFF" name="DCRCXOR" values="DCRCXOR__DCRCXOR" />
         </register>
