Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MK-GP_DFP/1.4.117/atdf/PIC32MK0512GPG048.atdf
         <register caption="" name="CNENA" offset="0x80" rw="RW" size="4">
            <bitfield mask="0x00000001" name="CNENA" />
            <bitfield mask="0x00000002" name="CNENA" />
            <bitfield mask="0x00000004" name="CNENA" />
            <bitfield mask="0x00000008" name="CNENA" />
            <bitfield mask="0x00000010" name="CNENA" />
            <bitfield mask="0x00000020" name="CNENA" />
            <bitfield mask="0x00000040" name="CNENA" />
            <bitfield mask="0x00000080" name="CNENA" />
            <bitfield mask="0x00000100" name="CNENA" />
            <bitfield mask="0x00000200" name="CNENA" />
            <bitfield mask="0x00000400" name="CNENA" />
            <bitfield mask="0x00000800" name="CNENA" />
            <bitfield mask="0x00001000" name="CNENA" />
            <bitfield mask="0x00002000" name="CNENA" />
            <bitfield mask="0x00004000" name="CNENA" />
            <bitfield mask="0x00008000" name="CNENA" />
         </register>
         <register caption="" name="CNENB" offset="0x180" rw="RW" size="4">
            <bitfield mask="0x00000001" name="CNENB" />
            <bitfield mask="0x00000002" name="CNENB" />
            <bitfield mask="0x00000004" name="CNENB" />
            <bitfield mask="0x00000008" name="CNENB" />
            <bitfield mask="0x00000010" name="CNENB" />
            <bitfield mask="0x00000020" name="CNENB" />
            <bitfield mask="0x00000040" name="CNENB" />
            <bitfield mask="0x00000080" name="CNENB" />
            <bitfield mask="0x00000100" name="CNENB" />
            <bitfield mask="0x00000200" name="CNENB" />
            <bitfield mask="0x00000400" name="CNENB" />
            <bitfield mask="0x00000800" name="CNENB" />
            <bitfield mask="0x00001000" name="CNENB" />
            <bitfield mask="0x00002000" name="CNENB" />
            <bitfield mask="0x00004000" name="CNENB" />
            <bitfield mask="0x00008000" name="CNENB" />
         </register>
         <register caption="" name="CNENC" offset="0x280" rw="RW" size="4">
            <bitfield mask="0x00000001" name="CNENC" />
            <bitfield mask="0x00000002" name="CNENC" />
            <bitfield mask="0x00000004" name="CNENC" />
            <bitfield mask="0x00000008" name="CNENC" />
            <bitfield mask="0x00000010" name="CNENC" />
            <bitfield mask="0x00000020" name="CNENC" />
            <bitfield mask="0x00000040" name="CNENC" />
            <bitfield mask="0x00000080" name="CNENC" />
            <bitfield mask="0x00000100" name="CNENC" />
            <bitfield mask="0x00000200" name="CNENC" />
            <bitfield mask="0x00000400" name="CNENC" />
            <bitfield mask="0x00000800" name="CNENC" />
            <bitfield mask="0x00001000" name="CNENC" />
            <bitfield mask="0x00002000" name="CNENC" />
            <bitfield mask="0x00004000" name="CNENC" />
            <bitfield mask="0x00008000" name="CNENC" />
         </register>
         <register caption="" name="CNEND" offset="0x380" rw="RW" size="4">
            <bitfield mask="0x00000001" name="CNEND" />
            <bitfield mask="0x00000002" name="CNEND" />
            <bitfield mask="0x00000004" name="CNEND" />
            <bitfield mask="0x00000008" name="CNEND" />
            <bitfield mask="0x00000010" name="CNEND" />
            <bitfield mask="0x00000020" name="CNEND" />
            <bitfield mask="0x00000040" name="CNEND" />
            <bitfield mask="0x00000080" name="CNEND" />
            <bitfield mask="0x00000100" name="CNEND" />
            <bitfield mask="0x00000200" name="CNEND" />
            <bitfield mask="0x00000400" name="CNEND" />
            <bitfield mask="0x00000800" name="CNEND" />
            <bitfield mask="0x00001000" name="CNEND" />
            <bitfield mask="0x00002000" name="CNEND" />
            <bitfield mask="0x00004000" name="CNEND" />
            <bitfield mask="0x00008000" name="CNEND" />
         </register>
         <register caption="" name="CNSTATA" offset="0x90" rw="RW" size="4">
            <bitfield mask="0x00000001" name="CNSTATA" />
            <bitfield mask="0x00000002" name="CNSTATA" />
            <bitfield mask="0x00000004" name="CNSTATA" />
            <bitfield mask="0x00000008" name="CNSTATA" />
            <bitfield mask="0x00000010" name="CNSTATA" />
            <bitfield mask="0x00000020" name="CNSTATA" />
            <bitfield mask="0x00000040" name="CNSTATA" />
            <bitfield mask="0x00000080" name="CNSTATA" />
            <bitfield mask="0x00000100" name="CNSTATA" />
            <bitfield mask="0x00000200" name="CNSTATA" />
            <bitfield mask="0x00000400" name="CNSTATA" />
            <bitfield mask="0x00000800" name="CNSTATA" />
            <bitfield mask="0x00001000" name="CNSTATA" />
            <bitfield mask="0x00002000" name="CNSTATA" />
            <bitfield mask="0x00004000" name="CNSTATA" />
            <bitfield mask="0x00008000" name="CNSTATA" />
         </register>
         <register caption="" name="CNSTATB" offset="0x190" rw="RW" size="4">
            <bitfield mask="0x00000001" name="CNSTATB" />
            <bitfield mask="0x00000002" name="CNSTATB" />
            <bitfield mask="0x00000004" name="CNSTATB" />
            <bitfield mask="0x00000008" name="CNSTATB" />
            <bitfield mask="0x00000010" name="CNSTATB" />
            <bitfield mask="0x00000020" name="CNSTATB" />
            <bitfield mask="0x00000040" name="CNSTATB" />
            <bitfield mask="0x00000080" name="CNSTATB" />
            <bitfield mask="0x00000100" name="CNSTATB" />
            <bitfield mask="0x00000200" name="CNSTATB" />
            <bitfield mask="0x00000400" name="CNSTATB" />
            <bitfield mask="0x00000800" name="CNSTATB" />
            <bitfield mask="0x00001000" name="CNSTATB" />
            <bitfield mask="0x00002000" name="CNSTATB" />
            <bitfield mask="0x00004000" name="CNSTATB" />
            <bitfield mask="0x00008000" name="CNSTATB" />
         </register>
         <register caption="" name="CNSTATC" offset="0x290" rw="RW" size="4">
            <bitfield mask="0x00000001" name="CNSTATC" />
            <bitfield mask="0x00000002" name="CNSTATC" />
            <bitfield mask="0x00000004" name="CNSTATC" />
            <bitfield mask="0x00000008" name="CNSTATC" />
            <bitfield mask="0x00000010" name="CNSTATC" />
            <bitfield mask="0x00000020" name="CNSTATC" />
            <bitfield mask="0x00000040" name="CNSTATC" />
            <bitfield mask="0x00000080" name="CNSTATC" />
            <bitfield mask="0x00000100" name="CNSTATC" />
            <bitfield mask="0x00000200" name="CNSTATC" />
            <bitfield mask="0x00000400" name="CNSTATC" />
            <bitfield mask="0x00000800" name="CNSTATC" />
            <bitfield mask="0x00001000" name="CNSTATC" />
            <bitfield mask="0x00002000" name="CNSTATC" />
            <bitfield mask="0x00004000" name="CNSTATC" />
            <bitfield mask="0x00008000" name="CNSTATC" />
         </register>
         <register caption="" name="CNSTATD" offset="0x390" rw="RW" size="4">
            <bitfield mask="0x00000001" name="CNSTATD" />
            <bitfield mask="0x00000002" name="CNSTATD" />
            <bitfield mask="0x00000004" name="CNSTATD" />
            <bitfield mask="0x00000008" name="CNSTATD" />
            <bitfield mask="0x00000010" name="CNSTATD" />
            <bitfield mask="0x00000020" name="CNSTATD" />
            <bitfield mask="0x00000040" name="CNSTATD" />
            <bitfield mask="0x00000080" name="CNSTATD" />
            <bitfield mask="0x00000100" name="CNSTATD" />
            <bitfield mask="0x00000200" name="CNSTATD" />
            <bitfield mask="0x00000400" name="CNSTATD" />
            <bitfield mask="0x00000800" name="CNSTATD" />
            <bitfield mask="0x00001000" name="CNSTATD" />
            <bitfield mask="0x00002000" name="CNSTATD" />
            <bitfield mask="0x00004000" name="CNSTATD" />
            <bitfield mask="0x00008000" name="CNSTATD" />
         </register>
         <register caption="" name="CNNEA" offset="0xa0" rw="RW" size="4">
            <bitfield mask="0x00000001" name="CNNEA" />
            <bitfield mask="0x00000002" name="CNNEA" />
            <bitfield mask="0x00000004" name="CNNEA" />
            <bitfield mask="0x00000008" name="CNNEA" />
            <bitfield mask="0x00000010" name="CNNEA" />
            <bitfield mask="0x00000020" name="CNNEA" />
            <bitfield mask="0x00000040" name="CNNEA" />
            <bitfield mask="0x00000080" name="CNNEA" />
            <bitfield mask="0x00000100" name="CNNEA" />
            <bitfield mask="0x00000200" name="CNNEA" />
            <bitfield mask="0x00000400" name="CNNEA" />
            <bitfield mask="0x00000800" name="CNNEA" />
            <bitfield mask="0x00001000" name="CNNEA" />
            <bitfield mask="0x00002000" name="CNNEA" />
            <bitfield mask="0x00004000" name="CNNEA" />
            <bitfield mask="0x00008000" name="CNNEA" />
         </register>
         <register caption="" name="CNNEB" offset="0x1a0" rw="RW" size="4">
            <bitfield mask="0x00000001" name="CNNEB" />
            <bitfield mask="0x00000002" name="CNNEB" />
            <bitfield mask="0x00000004" name="CNNEB" />
            <bitfield mask="0x00000008" name="CNNEB" />
            <bitfield mask="0x00000010" name="CNNEB" />
            <bitfield mask="0x00000020" name="CNNEB" />
            <bitfield mask="0x00000040" name="CNNEB" />
            <bitfield mask="0x00000080" name="CNNEB" />
            <bitfield mask="0x00000100" name="CNNEB" />
            <bitfield mask="0x00000200" name="CNNEB" />
            <bitfield mask="0x00000400" name="CNNEB" />
            <bitfield mask="0x00000800" name="CNNEB" />
            <bitfield mask="0x00001000" name="CNNEB" />
            <bitfield mask="0x00002000" name="CNNEB" />
            <bitfield mask="0x00004000" name="CNNEB" />
            <bitfield mask="0x00008000" name="CNNEB" />
         </register>
         <register caption="" name="CNNEC" offset="0x2a0" rw="RW" size="4">
            <bitfield mask="0x00000001" name="CNNEC" />
            <bitfield mask="0x00000002" name="CNNEC" />
            <bitfield mask="0x00000004" name="CNNEC" />
            <bitfield mask="0x00000008" name="CNNEC" />
            <bitfield mask="0x00000010" name="CNNEC" />
            <bitfield mask="0x00000020" name="CNNEC" />
            <bitfield mask="0x00000040" name="CNNEC" />
            <bitfield mask="0x00000080" name="CNNEC" />
            <bitfield mask="0x00000100" name="CNNEC" />
            <bitfield mask="0x00000200" name="CNNEC" />
            <bitfield mask="0x00000400" name="CNNEC" />
            <bitfield mask="0x00000800" name="CNNEC" />
            <bitfield mask="0x00001000" name="CNNEC" />
            <bitfield mask="0x00002000" name="CNNEC" />
            <bitfield mask="0x00004000" name="CNNEC" />
            <bitfield mask="0x00008000" name="CNNEC" />
         </register>
         <register caption="" name="CNNED" offset="0x3a0" rw="RW" size="4">
            <bitfield mask="0x00000001" name="CNNED" />
            <bitfield mask="0x00000002" name="CNNED" />
            <bitfield mask="0x00000004" name="CNNED" />
            <bitfield mask="0x00000008" name="CNNED" />
            <bitfield mask="0x00000010" name="CNNED" />
            <bitfield mask="0x00000020" name="CNNED" />
            <bitfield mask="0x00000040" name="CNNED" />
            <bitfield mask="0x00000080" name="CNNED" />
            <bitfield mask="0x00000100" name="CNNED" />
            <bitfield mask="0x00000200" name="CNNED" />
            <bitfield mask="0x00000400" name="CNNED" />
            <bitfield mask="0x00000800" name="CNNED" />
            <bitfield mask="0x00001000" name="CNNED" />
            <bitfield mask="0x00002000" name="CNNED" />
            <bitfield mask="0x00004000" name="CNNED" />
            <bitfield mask="0x00008000" name="CNNED" />
         </register>
         <register caption="" name="CNFA" offset="0xb0" rw="RW" size="4">
            <bitfield mask="0x00000001" name="CNFA" />
            <bitfield mask="0x00000002" name="CNFA" />
            <bitfield mask="0x00000004" name="CNFA" />
            <bitfield mask="0x00000008" name="CNFA" />
            <bitfield mask="0x00000010" name="CNFA" />
            <bitfield mask="0x00000020" name="CNFA" />
            <bitfield mask="0x00000040" name="CNFA" />
            <bitfield mask="0x00000080" name="CNFA" />
            <bitfield mask="0x00000100" name="CNFA" />
            <bitfield mask="0x00000200" name="CNFA" />
            <bitfield mask="0x00000400" name="CNFA" />
            <bitfield mask="0x00000800" name="CNFA" />
            <bitfield mask="0x00001000" name="CNFA" />
            <bitfield mask="0x00002000" name="CNFA" />
            <bitfield mask="0x00004000" name="CNFA" />
            <bitfield mask="0x00008000" name="CNFA" />
         </register>
         <register caption="" name="CNFB" offset="0x1b0" rw="RW" size="4">
            <bitfield mask="0x00000001" name="CNFB" />
            <bitfield mask="0x00000002" name="CNFB" />
            <bitfield mask="0x00000004" name="CNFB" />
            <bitfield mask="0x00000008" name="CNFB" />
            <bitfield mask="0x00000010" name="CNFB" />
            <bitfield mask="0x00000020" name="CNFB" />
            <bitfield mask="0x00000040" name="CNFB" />
            <bitfield mask="0x00000080" name="CNFB" />
            <bitfield mask="0x00000100" name="CNFB" />
            <bitfield mask="0x00000200" name="CNFB" />
            <bitfield mask="0x00000400" name="CNFB" />
            <bitfield mask="0x00000800" name="CNFB" />
            <bitfield mask="0x00001000" name="CNFB" />
            <bitfield mask="0x00002000" name="CNFB" />
            <bitfield mask="0x00004000" name="CNFB" />
            <bitfield mask="0x00008000" name="CNFB" />
         </register>
         <register caption="" name="CNFC" offset="0x2b0" rw="RW" size="4">
            <bitfield mask="0x00000001" name="CNFC" />
            <bitfield mask="0x00000002" name="CNFC" />
            <bitfield mask="0x00000004" name="CNFC" />
            <bitfield mask="0x00000008" name="CNFC" />
            <bitfield mask="0x00000010" name="CNFC" />
            <bitfield mask="0x00000020" name="CNFC" />
            <bitfield mask="0x00000040" name="CNFC" />
            <bitfield mask="0x00000080" name="CNFC" />
            <bitfield mask="0x00000100" name="CNFC" />
            <bitfield mask="0x00000200" name="CNFC" />
            <bitfield mask="0x00000400" name="CNFC" />
            <bitfield mask="0x00000800" name="CNFC" />
            <bitfield mask="0x00001000" name="CNFC" />
            <bitfield mask="0x00002000" name="CNFC" />
            <bitfield mask="0x00004000" name="CNFC" />
            <bitfield mask="0x00008000" name="CNFC" />
         </register>
         <register caption="" name="CNFD" offset="0x3b0" rw="RW" size="4">
            <bitfield mask="0x00000001" name="CNFD" />
            <bitfield mask="0x00000002" name="CNFD" />
            <bitfield mask="0x00000004" name="CNFD" />
            <bitfield mask="0x00000008" name="CNFD" />
            <bitfield mask="0x00000010" name="CNFD" />
            <bitfield mask="0x00000020" name="CNFD" />
            <bitfield mask="0x00000040" name="CNFD" />
            <bitfield mask="0x00000080" name="CNFD" />
            <bitfield mask="0x00000100" name="CNFD" />
            <bitfield mask="0x00000200" name="CNFD" />
            <bitfield mask="0x00000400" name="CNFD" />
            <bitfield mask="0x00000800" name="CNFD" />
            <bitfield mask="0x00001000" name="CNFD" />
            <bitfield mask="0x00002000" name="CNFD" />
            <bitfield mask="0x00004000" name="CNFD" />
            <bitfield mask="0x00008000" name="CNFD" />
         </register>
         <register caption="" name="SRCON0A" offset="0xc0" rw="RW" size="4">
            <bitfield mask="0x00000001" name="SRCON0A" />
            <bitfield mask="0x00000002" name="SRCON0A" />
            <bitfield mask="0x00000004" name="SRCON0A" />
            <bitfield mask="0x00000008" name="SRCON0A" />
            <bitfield mask="0x00000010" name="SRCON0A" />
            <bitfield mask="0x00000020" name="SRCON0A" />
            <bitfield mask="0x00000040" name="SRCON0A" />
            <bitfield mask="0x00000080" name="SRCON0A" />
            <bitfield mask="0x00000100" name="SRCON0A" />
            <bitfield mask="0x00000200" name="SRCON0A" />
            <bitfield mask="0x00000400" name="SRCON0A" />
            <bitfield mask="0x00000800" name="SRCON0A" />
            <bitfield mask="0x00001000" name="SRCON0A" />
            <bitfield mask="0x00002000" name="SRCON0A" />
            <bitfield mask="0x00004000" name="SRCON0A" />
            <bitfield mask="0x00008000" name="SRCON0A" />
         </register>
         <register caption="" name="SRCON0B" offset="0x1c0" rw="RW" size="4">
            <bitfield mask="0x00000001" name="SRCON0B" />
            <bitfield mask="0x00000002" name="SRCON0B" />
            <bitfield mask="0x00000004" name="SRCON0B" />
            <bitfield mask="0x00000008" name="SRCON0B" />
            <bitfield mask="0x00000010" name="SRCON0B" />
            <bitfield mask="0x00000020" name="SRCON0B" />
            <bitfield mask="0x00000040" name="SRCON0B" />
            <bitfield mask="0x00000080" name="SRCON0B" />
            <bitfield mask="0x00000100" name="SRCON0B" />
            <bitfield mask="0x00000200" name="SRCON0B" />
            <bitfield mask="0x00000400" name="SRCON0B" />
            <bitfield mask="0x00000800" name="SRCON0B" />
            <bitfield mask="0x00001000" name="SRCON0B" />
            <bitfield mask="0x00002000" name="SRCON0B" />
            <bitfield mask="0x00004000" name="SRCON0B" />
            <bitfield mask="0x00008000" name="SRCON0B" />
         </register>
         <register caption="" name="SRCON0C" offset="0x2c0" rw="RW" size="4">
            <bitfield mask="0x00000001" name="SRCON0C" />
            <bitfield mask="0x00000002" name="SRCON0C" />
            <bitfield mask="0x00000004" name="SRCON0C" />
            <bitfield mask="0x00000008" name="SRCON0C" />
            <bitfield mask="0x00000010" name="SRCON0C" />
            <bitfield mask="0x00000020" name="SRCON0C" />
            <bitfield mask="0x00000040" name="SRCON0C" />
            <bitfield mask="0x00000080" name="SRCON0C" />
            <bitfield mask="0x00000100" name="SRCON0C" />
            <bitfield mask="0x00000200" name="SRCON0C" />
            <bitfield mask="0x00000400" name="SRCON0C" />
            <bitfield mask="0x00000800" name="SRCON0C" />
            <bitfield mask="0x00001000" name="SRCON0C" />
            <bitfield mask="0x00002000" name="SRCON0C" />
            <bitfield mask="0x00004000" name="SRCON0C" />
            <bitfield mask="0x00008000" name="SRCON0C" />
         </register>
         <register caption="" name="SRCON0D" offset="0x3c0" rw="RW" size="4">
            <bitfield mask="0x00000001" name="SRCON0D" />
            <bitfield mask="0x00000002" name="SRCON0D" />
            <bitfield mask="0x00000004" name="SRCON0D" />
            <bitfield mask="0x00000008" name="SRCON0D" />
            <bitfield mask="0x00000010" name="SRCON0D" />
            <bitfield mask="0x00000020" name="SRCON0D" />
            <bitfield mask="0x00000040" name="SRCON0D" />
            <bitfield mask="0x00000080" name="SRCON0D" />
            <bitfield mask="0x00000100" name="SRCON0D" />
            <bitfield mask="0x00000200" name="SRCON0D" />
            <bitfield mask="0x00000400" name="SRCON0D" />
            <bitfield mask="0x00000800" name="SRCON0D" />
            <bitfield mask="0x00001000" name="SRCON0D" />
            <bitfield mask="0x00002000" name="SRCON0D" />
            <bitfield mask="0x00004000" name="SRCON0D" />
            <bitfield mask="0x00008000" name="SRCON0D" />
         </register>
         <register caption="" name="SRCON1A" offset="0xd0" rw="RW" size="4">
            <bitfield mask="0x00000001" name="SRCON1A" />
            <bitfield mask="0x00000002" name="SRCON1A" />
            <bitfield mask="0x00000004" name="SRCON1A" />
            <bitfield mask="0x00000008" name="SRCON1A" />
            <bitfield mask="0x00000010" name="SRCON1A" />
            <bitfield mask="0x00000020" name="SRCON1A" />
            <bitfield mask="0x00000040" name="SRCON1A" />
            <bitfield mask="0x00000080" name="SRCON1A" />
            <bitfield mask="0x00000100" name="SRCON1A" />
            <bitfield mask="0x00000200" name="SRCON1A" />
            <bitfield mask="0x00000400" name="SRCON1A" />
            <bitfield mask="0x00000800" name="SRCON1A" />
            <bitfield mask="0x00001000" name="SRCON1A" />
            <bitfield mask="0x00002000" name="SRCON1A" />
            <bitfield mask="0x00004000" name="SRCON1A" />
            <bitfield mask="0x00008000" name="SRCON1A" />
         </register>
