Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MK-GP_DFP/1.4.117/atdf/PIC32MK0512GPG048.atdf
         <register caption="" name="SRCON1B" offset="0x1d0" rw="RW" size="4">
            <bitfield mask="0x00000001" name="SRCON1B" />
            <bitfield mask="0x00000002" name="SRCON1B" />
            <bitfield mask="0x00000004" name="SRCON1B" />
            <bitfield mask="0x00000008" name="SRCON1B" />
            <bitfield mask="0x00000010" name="SRCON1B" />
            <bitfield mask="0x00000020" name="SRCON1B" />
            <bitfield mask="0x00000040" name="SRCON1B" />
            <bitfield mask="0x00000080" name="SRCON1B" />
            <bitfield mask="0x00000100" name="SRCON1B" />
            <bitfield mask="0x00000200" name="SRCON1B" />
            <bitfield mask="0x00000400" name="SRCON1B" />
            <bitfield mask="0x00000800" name="SRCON1B" />
            <bitfield mask="0x00001000" name="SRCON1B" />
            <bitfield mask="0x00002000" name="SRCON1B" />
            <bitfield mask="0x00004000" name="SRCON1B" />
            <bitfield mask="0x00008000" name="SRCON1B" />
         </register>
         <register caption="" name="SRCON1C" offset="0x2d0" rw="RW" size="4">
            <bitfield mask="0x00000001" name="SRCON1C" />
            <bitfield mask="0x00000002" name="SRCON1C" />
            <bitfield mask="0x00000004" name="SRCON1C" />
            <bitfield mask="0x00000008" name="SRCON1C" />
            <bitfield mask="0x00000010" name="SRCON1C" />
            <bitfield mask="0x00000020" name="SRCON1C" />
            <bitfield mask="0x00000040" name="SRCON1C" />
            <bitfield mask="0x00000080" name="SRCON1C" />
            <bitfield mask="0x00000100" name="SRCON1C" />
            <bitfield mask="0x00000200" name="SRCON1C" />
            <bitfield mask="0x00000400" name="SRCON1C" />
            <bitfield mask="0x00000800" name="SRCON1C" />
            <bitfield mask="0x00001000" name="SRCON1C" />
            <bitfield mask="0x00002000" name="SRCON1C" />
            <bitfield mask="0x00004000" name="SRCON1C" />
            <bitfield mask="0x00008000" name="SRCON1C" />
         </register>
         <register caption="" name="SRCON1D" offset="0x3d0" rw="RW" size="4">
            <bitfield mask="0x00000001" name="SRCON1D" />
            <bitfield mask="0x00000002" name="SRCON1D" />
            <bitfield mask="0x00000004" name="SRCON1D" />
            <bitfield mask="0x00000008" name="SRCON1D" />
            <bitfield mask="0x00000010" name="SRCON1D" />
            <bitfield mask="0x00000020" name="SRCON1D" />
            <bitfield mask="0x00000040" name="SRCON1D" />
            <bitfield mask="0x00000080" name="SRCON1D" />
            <bitfield mask="0x00000100" name="SRCON1D" />
            <bitfield mask="0x00000200" name="SRCON1D" />
            <bitfield mask="0x00000400" name="SRCON1D" />
            <bitfield mask="0x00000800" name="SRCON1D" />
            <bitfield mask="0x00001000" name="SRCON1D" />
            <bitfield mask="0x00002000" name="SRCON1D" />
            <bitfield mask="0x00004000" name="SRCON1D" />
            <bitfield mask="0x00008000" name="SRCON1D" />
         </register>
      </register-group>
      <value-group caption="Change Notification Style bit" name="CNCONA__EDGEDETECT">
         <value caption="Edge Style. Detect edge transitions (CNFx used for CN Event)." name="" value="0x1" />
         <value caption="Mismatch Style. Detect change from last PORTx read (CNSTATx used for CN Event)." name="" value="0x0" />
      </value-group>
      <value-group caption="Change Notice Control ON bit" name="CNCONA__ON">
         <value caption="CN is enabled" name="" value="0x1" />
         <value caption="CN is disabled" name="" value="0x0" />
      </value-group>
      <value-group caption="Change Notification Style bit" name="CNCONB__EDGEDETECT">
         <value caption="Edge Style. Detect edge transitions (CNFx used for CN Event)." name="" value="0x1" />
         <value caption="Mismatch Style. Detect change from last PORTx read (CNSTATx used for CN Event)." name="" value="0x0" />
      </value-group>
      <value-group caption="Change Notice Control ON bit" name="CNCONB__ON">
         <value caption="CN is enabled" name="" value="0x1" />
         <value caption="CN is disabled" name="" value="0x0" />
      </value-group>
      <value-group caption="Change Notification Style bit" name="CNCONC__EDGEDETECT">
         <value caption="Edge Style. Detect edge transitions (CNFx used for CN Event)." name="" value="0x1" />
         <value caption="Mismatch Style. Detect change from last PORTx read (CNSTATx used for CN Event)." name="" value="0x0" />
      </value-group>
      <value-group caption="Change Notice Control ON bit" name="CNCONC__ON">
         <value caption="CN is enabled" name="" value="0x1" />
         <value caption="CN is disabled" name="" value="0x0" />
      </value-group>
      <value-group caption="Change Notification Style bit" name="CNCOND__EDGEDETECT">
         <value caption="Edge Style. Detect edge transitions (CNFx used for CN Event)." name="" value="0x1" />
         <value caption="Mismatch Style. Detect change from last PORTx read (CNSTATx used for CN Event)." name="" value="0x0" />
      </value-group>
      <value-group caption="Change Notice Control ON bit" name="CNCOND__ON">
         <value caption="CN is enabled" name="" value="0x1" />
         <value caption="CN is disabled" name="" value="0x0" />
      </value-group>
   </module>
   <module caption="" id="02511" name="HLVD" version="">
      <register-group name="HLVD">
         <register caption="High/Low-Voltage Detect Control Register" name="HLVDCON" offset="0x0" rw="RW" size="4">
            <bitfield caption="High/Low-Voltage Detection Limit Select bits" mask="0x0000000F" name="HLVDL" values="HLVDCON__HLVDL" />
            <bitfield caption="Disable HLVD Output bit" mask="0x00000080" name="DISOUT" values="HLVDCON__DISOUT" />
            <bitfield caption="High/Low-Voltage Detection Event Status bit" mask="0x00000100" name="HLEVT" values="HLVDCON__HLEVT" />
            <bitfield caption="Band Gap Reference Voltages Stable Status bit" mask="0x00000400" name="BGVST" values="HLVDCON__BGVST" />
            <bitfield caption="Voltage Change Direction Select bit" mask="0x00000800" name="VDIR" values="HLVDCON__VDIR" />
            <bitfield caption="HLVD Module Enable bit" mask="0x00008000" name="ON" values="HLVDCON__ON" />
         </register>
      </register-group>
      <value-group caption="High/Low-Voltage Detection Limit Select bits" name="HLVDCON__HLVDL">
         <value caption="1.2V (Selects external LVDIN pin)" name="" value="0xf" />
         <value caption="2.4V" name="" value="0xa" />
         <value caption="2.5V" name="" value="0x9" />
         <value caption="2.69V" name="" value="0x8" />
         <value caption="2.791V" name="" value="0x7" />
         <value caption="3.0V" name="" value="0x6" />
         <value caption="3.288V" name="" value="0x5" />
         <value caption="3.529V" name="" value="0x4" />
      </value-group>
      <value-group caption="Disable HLVD Output bit" name="HLVDCON__DISOUT">
         <value caption="Enable output of HLVD Comparator. Once set, can only be cleared by setting the ON bit to 0." name="" value="0x1" />
         <value caption="Disable output of HLVD Comparator (default Reset value)." name="" value="0x0" />
      </value-group>
