Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MK-GP_DFP/1.4.117/atdf/PIC32MK0512GPG048.atdf
      <value-group caption="Write Enable bit" name="NVMCON__WREN">
         <value caption="Enable writes to the WR bit and disables writes to the NVMOP bits" name="" value="0x1" />
         <value caption="Disable writes to WR bit and enables writes to the NVMOP bits" name="" value="0x0" />
      </value-group>
      <value-group caption="Write Control bit" name="NVMCON__WR">
         <value caption="Initiate a Flash operation" name="" value="0x1" />
         <value caption="Flash operation is complete or inactive" name="" value="0x0" />
      </value-group>
      <value-group caption="Program Flash Memory Page Write-protect Unlock bit" name="NVMPWP__PWPULOCK">
         <value caption="Register is not locked and can be modified" name="" value="0x1" />
         <value caption="Register is locked and cannot be modified" name="" value="0x0" />
      </value-group>

      <value-group caption="Boot Alias Page 0 Write-protect bit" name="NVMBWP__BWP0">
         <value caption="Write protection for physical address 0x01FC00000 through 0x1FC03FFF enabled" name="" value="0x1" />
         <value caption="Write protection for physical address 0x01FC00000 through 0x1FC03FFF disabled" name="" value="0x0" />
      </value-group>
      <value-group caption="Boot Alias Page 1 Write-protect bit" name="NVMBWP__BWP1">
         <value caption="Write protection for physical address 0x01FC04000 through 0x1FC07FFF enabled" name="" value="0x1" />
         <value caption="Write protection for physical address 0x01FC04000 through 0x1FC07FFF disabled" name="" value="0x0" />
      </value-group>
      <value-group caption="Boot Alias Page 2 Write-protect bit" name="NVMBWP__BWP2">
         <value caption="Write protection for physical address 0x01FC08000 through 0x1FC0BFFF enabled" name="" value="0x1" />
         <value caption="Write protection for physical address 0x01FC08000 through 0x1FC0BFFF disabled" name="" value="0x0" />
      </value-group>
      <value-group caption="Boot Alias Page 3 Write-protect bit" name="NVMBWP__BWP3">
         <value caption="Write protection for physical address 0x01FC0C000 through 0x1FC0FFFF enabled" name="" value="0x1" />
         <value caption="Write protection for physical address 0x01FC0C000 through 0x1FC0FFFF disabled" name="" value="0x0" />
      </value-group>
      <value-group caption="Boot Alias Page 4 Write-protect bit" name="NVMBWP__BWP4">
         <value caption="Write protection for physical address 0x01FC10000 through 0x1FC13FFF enabled" name="" value="0x1" />
         <value caption="Write protection for physical address 0x01FC10000 through 0x1FC13FFF disabled" name="" value="0x0" />
      </value-group>
      <value-group caption="Lower Boot Alias Write-protect Unlock bit" name="NVMBWP__BWPULOCK">
         <value caption="LBWPx bits are not locked and can be modified" name="" value="0x1" />
         <value caption="LBWPx bits are locked and cannot be modified" name="" value="0x0" />
      </value-group>
      <value-group caption="Erase Retry Control bits" name="NVMCON2__ERETRY">
         <value caption="Erase strength for last retry cycle" name="" value="0x3" />
         <value caption="Erase strength for third retry cycle" name="" value="0x2" />
         <value caption="Erase strength for second retry cycle" name="" value="0x1" />
         <value caption="Erase strength for first retry cycle" name="" value="0x0" />
      </value-group>
      <value-group caption="Verify Read of Logic 1 Control bit" name="NVMCON2__VREAD1">
         <value caption="Selects Erase Retry Procedure with Verify Read" name="" value="0x1" />
         <value caption="Selects Single Erase w/o Verify Read" name="" value="0x0" />
      </value-group>
      <value-group caption="" name="NVMCON2__CREAD1">
         <value caption="Selects Erase Retry Procedure with Verify Read" name="" value="0x1" />
         <value caption="Selects Single Erase w/o Verify Read" name="" value="0x0" />
      </value-group>
      <value-group caption="Low-Power Read Control bit" name="NVMCON2__LPRD">
         <value caption="Configures Flash for Low Power reads, but with slower higher latency access times" name="" value="0x1" />
         <value caption="Configures Flash for faster Low Latency reads, but at higher power consumption" name="" value="0x0" />
      </value-group>
      <value-group caption="" name="NVMCON2__LPRDWS">
         <value caption="31 Wait States" name="" value="0x1f" />
         <value caption="30 Wait States" name="" value="0x1e" />
         <value caption="29 Wait States" name="" value="0x1d" />
         <value caption="28 Wait States" name="" value="0x1c" />
         <value caption="27 Wait States" name="" value="0x1b" />
         <value caption="26 Wait States" name="" value="0x1a" />
         <value caption="25 Wait States" name="" value="0x19" />
         <value caption="24 Wait States" name="" value="0x18" />
         <value caption="23 Wait States" name="" value="0x17" />
         <value caption="22 Wait States" name="" value="0x16" />
         <value caption="21 Wait States" name="" value="0x15" />
         <value caption="20 Wait States" name="" value="0x14" />
         <value caption="19 Wait States" name="" value="0x13" />
         <value caption="18 Wait States" name="" value="0x12" />
         <value caption="17 Wait States" name="" value="0x11" />
         <value caption="16 Wait States" name="" value="0x10" />
         <value caption="15 Wait States" name="" value="0xf" />
         <value caption="14 Wait States" name="" value="0xe" />
         <value caption="13 Wait States" name="" value="0xd" />
         <value caption="12 Wait States" name="" value="0xc" />
         <value caption="11 Wait States" name="" value="0xb" />
         <value caption="10 Wait States" name="" value="0xa" />
         <value caption="9 Wait States" name="" value="0x9" />
         <value caption="8 Wait States" name="" value="0x8" />
         <value caption="7 Wait States" name="" value="0x7" />
         <value caption="6 Wait States" name="" value="0x6" />
         <value caption="5 Wait States" name="" value="0x5" />
         <value caption="4 Wait States" name="" value="0x4" />
         <value caption="3 Wait States" name="" value="0x3" />
         <value caption="2 Wait States" name="" value="0x2" />
         <value caption="1 Wait States" name="" value="0x1" />
         <value caption="0 Wait States" name="" value="0x0" />
      </value-group>
   </module>
   <module caption="" id="00749" name="OCMP" version="1">
      <register-group name="OCMP">
         <register caption="Output Compare 'x' Control Register" name="OC1CON" offset="0x0" rw="RW" size="4">
            <bitfield caption="Output Compare Mode Select bits" mask="0x00000007" name="OCM" values="OC1CON__OCM" />
            <bitfield caption="Output Compare Timer Select bit" mask="0x00000008" name="OCTSEL" values="OC1CON__OCTSEL" />
            <bitfield caption="PWM Fault Condition Status bit" mask="0x00000010" name="OCFLT" values="OC1CON__OCFLT" />
            <bitfield caption="32-bit Compare Mode bit" mask="0x00000020" name="OC32" values="OC1CON__OC32" />
            <bitfield caption="Stop in Idle Mode bit" mask="0x00002000" name="SIDL" values="OC1CON__SIDL" />
            <bitfield caption="Output Compare Peripheral On bit" mask="0x00008000" name="ON" values="OC1CON__ON" />
         </register>
